## 테라폼 구축 계획
 #### terraform init ⚙️`success`
 #### terraform fmt 🖌`success`
 #### terraform validate 🤖`success`
 <details><summary>문법 검사 결과</summary>

 ```

 Success! The configuration is valid.


 ```

 </details>

 #### terraform plan 📖`success`

 <details><summary>테라폼 구축 계획</summary>

 ```

 terraform
Acquiring state lock. This may take a few moments...
module.route53.data.aws_route53_zone.selected: Reading...
module.was.data.aws_ami.ubuntu: Reading...
module.web.data.aws_ami.ubuntu: Reading...
module.db.data.aws_secretsmanager_secret.by-name: Reading...
module.route53.data.aws_lb_hosted_zone_id.main: Reading...
module.public_lb.data.aws_acm_certificate.amazon_issued: Reading...
module.route53.data.aws_lb_hosted_zone_id.main: Read complete after 0s [id=ZWKZPGTI48KDX]
module.route53.data.aws_route53_zone.selected: Read complete after 1s [id=Z05489631OD6CTLXAVCWK]
module.db.data.aws_secretsmanager_secret.by-name: Read complete after 1s [id=arn:aws:secretsmanager:ap-northeast-2:458197257493:secret:db-secret-6sXuZX]
module.db.data.aws_secretsmanager_secret_version.db-secret: Reading...
module.was.data.aws_ami.ubuntu: Read complete after 1s [id=ami-037f5c5c1aab1ae51]
module.web.data.aws_ami.ubuntu: Read complete after 2s [id=ami-037f5c5c1aab1ae51]
module.db.data.aws_secretsmanager_secret_version.db-secret: Read complete after 1s [id=arn:aws:secretsmanager:ap-northeast-2:458197257493:secret:db-secret-6sXuZX|AWSCURRENT]
module.public_lb.data.aws_acm_certificate.amazon_issued: Read complete after 2s [id=arn:aws:acm:ap-northeast-2:458197257493:certificate/8d41f3f3-96de-4dd5-8f9a-e72e5e5ef013]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.db.aws_db_instance.this will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "postgres"
      + db_subnet_group_name                  = "joo-var.db-subnet-group"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "15.3"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "joo"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = true
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name"  = "joo-postgres"
          + "owner" = "joo"
        }
      + tags_all                              = {
          + "Name"  = "joo-postgres"
          + "owner" = "joo"
        }
      + timezone                              = (known after apply)
      + username                              = (sensitive value)
      + vpc_security_group_ids                = (known after apply)
    }

  # module.db.aws_db_subnet_group.this will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "joo-var.db-subnet-group"
      + id                      = (known after apply)
      + name                    = "joo-var.db-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name"  = "joo-db-subnet-group"
          + "owner" = "joo"
        }
      + tags_all                = {
          + "Name"  = "joo-db-subnet-group"
          + "owner" = "joo"
        }
      + vpc_id                  = (known after apply)
    }

  # module.db.aws_security_group.db will be created
  + resource "aws_security_group" "db" {
      + arn                    = (known after apply)
      + description            = "joo-db-sg"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow postgresql"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "joo-db-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"  = "joo-db-sg"
          + "owner" = "joo"
        }
      + tags_all               = {
          + "Name"  = "joo-db-sg"
          + "owner" = "joo"
        }
      + vpc_id                 = (known after apply)
    }

  # module.iam.aws_iam_instance_profile.this will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "EC2InstanceProfileECR"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "ec2_role_ECR"
      + tags        = {
          + "Name"  = "joo-instance-profile-ecr"
          + "owner" = "joo"
        }
      + tags_all    = {
          + "Name"  = "joo-instance-profile-ecr"
          + "owner" = "joo"
        }
      + unique_id   = (known after apply)
    }

  # module.iam.aws_iam_policy.ecr_policy will be created
  + resource "aws_iam_policy" "ecr_policy" {
      + arn         = (known after apply)
      + description = "ecr policy"
      + id          = (known after apply)
      + name        = "ecr-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr-public:GetAuthorizationToken",
                          + "sts:GetServiceBearerToken",
                          + "ecr-public:BatchCheckLayerAvailability",
                          + "ecr-public:GetRepositoryPolicy",
                          + "ecr-public:DescribeRepositories",
                          + "ecr-public:DescribeRegistries",
                          + "ecr-public:DescribeImages",
                          + "ecr-public:DescribeImageTags",
                          + "ecr-public:GetRepositoryCatalogData",
                          + "ecr-public:GetRegistryCatalogData",
                          + "ecr-public:InitiateLayerUpload",
                          + "ecr-public:UploadLayerPart",
                          + "ecr-public:CompleteLayerUpload",
                          + "ecr-public:PutImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.iam.aws_iam_role.ec2_role will be created
  + resource "aws_iam_role" "ec2_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ec2_role_ECR"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"  = "joo-ec2-role"
          + "owner" = "joo"
        }
      + tags_all              = {
          + "Name"  = "joo-ec2-role"
          + "owner" = "joo"
        }
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.ec2_role will be created
  + resource "aws_iam_role_policy_attachment" "ec2_role" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ec2_role_ECR"
    }

  # module.network.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"  = "joo-ap-northeast-2a-eip"
          + "owner" = "joo"
        }
      + tags_all             = {
          + "Name"  = "joo-ap-northeast-2a-eip"
          + "owner" = "joo"
        }
      + vpc                  = (known after apply)
    }

  # module.network.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"  = "joo-ap-northeast-2c-eip"
          + "owner" = "joo"
        }
      + tags_all             = {
          + "Name"  = "joo-ap-northeast-2c-eip"
          + "owner" = "joo"
        }
      + vpc                  = (known after apply)
    }

  # module.network.aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"  = "joo-igw"
          + "owner" = "joo"
        }
      + tags_all = {
          + "Name"  = "joo-igw"
          + "owner" = "joo"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"  = "joo-ap-northeast-2a-nat-gateway"
          + "owner" = "joo"
        }
      + tags_all                           = {
          + "Name"  = "joo-ap-northeast-2a-nat-gateway"
          + "owner" = "joo"
        }
    }

  # module.network.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"  = "joo-ap-northeast-2c-nat-gateway"
          + "owner" = "joo"
        }
      + tags_all                           = {
          + "Name"  = "joo-ap-northeast-2c-nat-gateway"
          + "owner" = "joo"
        }
    }

  # module.network.aws_route.public_internet_gateway will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.network.aws_route.web_nat_gateway[0] will be created
  + resource "aws_route" "web_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.network.aws_route.web_nat_gateway[1] will be created
  + resource "aws_route" "web_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.network.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"  = "joo-ap-northeast-2a-public-route-table"
          + "owner" = "joo"
        }
      + tags_all         = {
          + "Name"  = "joo-ap-northeast-2a-public-route-table"
          + "owner" = "joo"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.web[0] will be created
  + resource "aws_route_table" "web" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"  = "joo-ap-northeast-2a-private-route-table"
          + "owner" = "joo"
        }
      + tags_all         = {
          + "Name"  = "joo-ap-northeast-2a-private-route-table"
          + "owner" = "joo"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.web[1] will be created
  + resource "aws_route_table" "web" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"  = "joo-ap-northeast-2c-private-route-table"
          + "owner" = "joo"
        }
      + tags_all         = {
          + "Name"  = "joo-ap-northeast-2c-private-route-table"
          + "owner" = "joo"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table_association.db[0] will be created
  + resource "aws_route_table_association" "db" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.db[1] will be created
  + resource "aws_route_table_association" "db" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.was[0] will be created
  + resource "aws_route_table_association" "was" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.was[1] will be created
  + resource "aws_route_table_association" "was" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.web[0] will be created
  + resource "aws_route_table_association" "web" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.web[1] will be created
  + resource "aws_route_table_association" "web" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_subnet.db[0] will be created
  + resource "aws_subnet" "db" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.80.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"  = "joo-ap-northeast-2a-db-subnet"
          + "owner" = "joo"
        }
      + tags_all                                       = {
          + "Name"  = "joo-ap-northeast-2a-db-subnet"
          + "owner" = "joo"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.db[1] will be created
  + resource "aws_subnet" "db" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.90.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"  = "joo-ap-northeast-2c-db-subnet"
          + "owner" = "joo"
        }
      + tags_all                                       = {
          + "Name"  = "joo-ap-northeast-2c-db-subnet"
          + "owner" = "joo"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_lb[0] will be created
  + resource "aws_subnet" "private_lb" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.40.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"  = "joo-ap-northeast-2a-private-lb-subnet"
          + "owner" = "joo"
        }
      + tags_all                                       = {
          + "Name"  = "joo-ap-northeast-2a-private-lb-subnet"
          + "owner" = "joo"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_lb[1] will be created
  + resource "aws_subnet" "private_lb" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.50.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"  = "joo-ap-northeast-2c-private-lb-subnet"
          + "owner" = "joo"
        }
      + tags_all                                       = {
          + "Name"  = "joo-ap-northeast-2c-private-lb-subnet"
          + "owner" = "joo"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"  = "joo-ap-northeast-2a-public-subnet"
          + "owner" = "joo"
        }
      + tags_all                                       = {
          + "Name"  = "joo-ap-northeast-2a-public-subnet"
          + "owner" = "joo"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"  = "joo-ap-northeast-2c-public-subnet"
          + "owner" = "joo"
        }
      + tags_all                                       = {
          + "Name"  = "joo-ap-northeast-2c-public-subnet"
          + "owner" = "joo"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.was[0] will be created
  + resource "aws_subnet" "was" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.60.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"  = "joo-ap-northeast-2a-was-subnet"
          + "owner" = "joo"
        }
      + tags_all                                       = {
          + "Name"  = "joo-ap-northeast-2a-was-subnet"
          + "owner" = "joo"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.was[1] will be created
  + resource "aws_subnet" "was" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.70.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"  = "joo-ap-northeast-2c-was-subnet"
          + "owner" = "joo"
        }
      + tags_all                                       = {
          + "Name"  = "joo-ap-northeast-2c-was-subnet"
          + "owner" = "joo"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.web[0] will be created
  + resource "aws_subnet" "web" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"  = "joo-ap-northeast-2a-web-subnet"
          + "owner" = "joo"
        }
      + tags_all                                       = {
          + "Name"  = "joo-ap-northeast-2a-web-subnet"
          + "owner" = "joo"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.web[1] will be created
  + resource "aws_subnet" "web" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.30.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"  = "joo-ap-northeast-2c-web-subnet"
          + "owner" = "joo"
        }
      + tags_all                                       = {
          + "Name"  = "joo-ap-northeast-2c-web-subnet"
          + "owner" = "joo"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"  = "joo-vpc"
          + "owner" = "joo"
        }
      + tags_all                             = {
          + "Name"  = "joo-vpc"
          + "owner" = "joo"
        }
    }

  # module.private_lb.aws_lb.private will be created
  + resource "aws_lb" "private" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = true
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "joo-private-lb"
      + name_prefix                                 = (known after apply)
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = (known after apply)
      + tags                                        = {
          + "Name"  = "joo-private-lb"
          + "owner" = "joo"
        }
      + tags_all                                    = {
          + "Name"  = "joo-private-lb"
          + "owner" = "joo"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # module.private_lb.aws_lb_listener.app will be created
  + resource "aws_lb_listener" "app" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "Name"  = "joo-private-lb-Listener"
          + "owner" = "joo"
        }
      + tags_all          = {
          + "Name"  = "joo-private-lb-Listener"
          + "owner" = "joo"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.private_lb.aws_lb_target_group.was will be created
  + resource "aws_lb_target_group" "was" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "was-TG"
      + name_prefix                        = (known after apply)
      + port                               = 8000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"  = "joo-was-TG"
          + "owner" = "joo"
        }
      + tags_all                           = {
          + "Name"  = "joo-was-TG"
          + "owner" = "joo"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)
    }

  # module.private_lb.aws_security_group.private_lb will be created
  + resource "aws_security_group" "private_lb" {
      + arn                    = (known after apply)
      + description            = "joo-private-lb-sg"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow app"
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8000
            },
        ]
      + name                   = "joo-private-lb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"  = "joo-private-lb-sg"
          + "owner" = "joo"
        }
      + tags_all               = {
          + "Name"  = "joo-private-lb-sg"
          + "owner" = "joo"
        }
      + vpc_id                 = (known after apply)
    }

  # module.public_lb.aws_lb.public will be created
  + resource "aws_lb" "public" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = (known after apply)
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "joo-public-lb"
      + name_prefix                                 = (known after apply)
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = (known after apply)
      + tags                                        = {
          + "Name"  = "joo-public-lb"
          + "owner" = "joo"
        }
      + tags_all                                    = {
          + "Name"  = "joo-public-lb"
          + "owner" = "joo"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # module.public_lb.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "Name"  = "joo-public-lb-http-Listener"
          + "owner" = "joo"
        }
      + tags_all          = {
          + "Name"  = "joo-public-lb-http-Listener"
          + "owner" = "joo"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.public_lb.aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:ap-northeast-2:458197257493:certificate/8d41f3f3-96de-4dd5-8f9a-e72e5e5ef013"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags              = {
          + "Name"  = "joo-public-lb-https-Listener"
          + "owner" = "joo"
        }
      + tags_all          = {
          + "Name"  = "joo-public-lb-https-Listener"
          + "owner" = "joo"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.public_lb.aws_lb_target_group.web will be created
  + resource "aws_lb_target_group" "web" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "web-TG"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"  = "joo-web-TG"
          + "owner" = "joo"
        }
      + tags_all                           = {
          + "Name"  = "joo-web-TG"
          + "owner" = "joo"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)
    }

  # module.public_lb.aws_security_group.public_lb will be created
  + resource "aws_security_group" "public_lb" {
      + arn                    = (known after apply)
      + description            = "joo-public-lb-sg"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow http"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow https"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "joo-public-lb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"  = "joo-public-lb-sg"
          + "owner" = "joo"
        }
      + tags_all               = {
          + "Name"  = "joo-public-lb-sg"
          + "owner" = "joo"
        }
      + vpc_id                 = (known after apply)
    }

  # module.route53.aws_route53_record.private_lb will be created
  + resource "aws_route53_record" "private_lb" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "lb"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = "ZWKZPGTI48KDX"
        }
    }

  # module.route53.aws_route53_record.public_lb will be created
  + resource "aws_route53_record" "public_lb" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "app"
      + type            = "A"
      + zone_id         = "Z05489631OD6CTLXAVCWK"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = "ZWKZPGTI48KDX"
        }
    }

  # module.route53.aws_route53_zone.private will be created
  + resource "aws_route53_zone" "private" {
      + arn                 = (known after apply)
      + comment             = "Private DNS for Private LB"
      + force_destroy       = true
      + id                  = (known after apply)
      + name                = "joo.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "Name"  = "joo-private-zone"
          + "owner" = "joo"
        }
      + tags_all            = {
          + "Name"  = "joo-private-zone"
          + "owner" = "joo"
        }
      + zone_id             = (known after apply)

      + vpc {
          + vpc_id     = (known after apply)
          + vpc_region = (known after apply)
        }
    }

  # module.was.aws_autoscaling_group.this will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 2
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 4
      + metrics_granularity              = "1Minute"
      + min_size                         = 2
      + name                             = "joo-was-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "5m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id   = (known after apply)
          + name = (known after apply)
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "joo-was"
        }
      + tag {
          + key                 = "owner"
          + propagate_at_launch = true
          + value               = "joo"
        }
    }

  # module.was.aws_launch_template.was will be created
  + resource "aws_launch_template" "was" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "joo-was-launch-template"
      + id                     = (known after apply)
      + image_id               = "ami-037f5c5c1aab1ae51"
      + instance_type          = "t3.micro"
      + key_name               = "juiceb"
      + latest_version         = (known after apply)
      + name                   = "joo-was-launch-template"
      + name_prefix            = (known after apply)
      + tags                   = {
          + "Name"  = "joo-was-launch-template"
          + "owner" = "joo"
        }
      + tags_all               = {
          + "Name"  = "joo-was-launch-template"
          + "owner" = "joo"
        }
      + user_data              = "IyEvYmluL2Jhc2gKCmVjaG8gIi4uLi4uLi4uLi0tLS0tLS0tLS0tLS0tLS0jIyMjIyMjIyMjIyMjIyMjIy5fLi0uLUlOU1RBTEwtRG9ja2VyLi0uXy4jIyMjIyMjIyMjIyMjIyMjIy0tLS0tLS0tLS0tLS0tLS0uLi4uLi4uLi4iCnN1ZG8gYXB0LWdldCB1cGRhdGUKc3VkbyBhcHQtZ2V0IGluc3RhbGwgY2EtY2VydGlmaWNhdGVzIGN1cmwgZ251cGcgLXkKc3VkbyBpbnN0YWxsIC1tIDA3NTUgLWQgL2V0Yy9hcHQva2V5cmluZ3MKY3VybCAtZnNTTCBodHRwczovL2Rvd25sb2FkLmRvY2tlci5jb20vbGludXgvdWJ1bnR1L2dwZyB8IHN1ZG8gZ3BnIC0tZGVhcm1vciAtbyAvZXRjL2FwdC9rZXlyaW5ncy9kb2NrZXIuZ3BnCnN1ZG8gY2htb2QgYStyIC9ldGMvYXB0L2tleXJpbmdzL2RvY2tlci5ncGcKZWNobyBcCiAgImRlYiBbYXJjaD0iJChkcGtnIC0tcHJpbnQtYXJjaGl0ZWN0dXJlKSIgc2lnbmVkLWJ5PS9ldGMvYXB0L2tleXJpbmdzL2RvY2tlci5ncGddIGh0dHBzOi8vZG93bmxvYWQuZG9ja2VyLmNvbS9saW51eC91YnVudHUgXAogICIkKC4gL2V0Yy9vcy1yZWxlYXNlICYmIGVjaG8gIiRWRVJTSU9OX0NPREVOQU1FIikiIHN0YWJsZSIgfCBcCiAgc3VkbyB0ZWUgL2V0Yy9hcHQvc291cmNlcy5saXN0LmQvZG9ja2VyLmxpc3QgPiAvZGV2L251bGwKc3VkbyBhcHQtZ2V0IHVwZGF0ZQpzdWRvIGFwdC1nZXQgaW5zdGFsbCBkb2NrZXItY2UgZG9ja2VyLWNlLWNsaSBjb250YWluZXJkLmlvIGRvY2tlci1idWlsZHgtcGx1Z2luIGRvY2tlci1jb21wb3NlLXBsdWdpbiAteQoKZWNobyAiLi4uLi4uLi4uLS0tLS0tLS0tLS0tLS0tLSMjIyMjIyMjIyMjIyMjIyMjLl8uLS4tSU5TVEFMTC1BV1MtQ0xJLi0uXy4jIyMjIyMjIyMjIyMjIyMjIy0tLS0tLS0tLS0tLS0tLS0uLi4uLi4uLi4iCnN1ZG8gYXB0IGluc3RhbGwgdW56aXAgLXkKY3VybCAiaHR0cHM6Ly9hd3NjbGkuYW1hem9uYXdzLmNvbS9hd3NjbGktZXhlLWxpbnV4LXg4Nl82NC56aXAiIC1vICJhd3NjbGl2Mi56aXAiCnN1ZG8gdW56aXAgYXdzY2xpdjIuemlwCnN1ZG8gLi9hd3MvaW5zdGFsbCAtaSAvdXNyL2xvY2FsL2F3cy1jbGkgLWIgL3Vzci9sb2NhbC9iaW4KCmVjaG8gIi4uLi4uLi4uLi0tLS0tLS0tLS0tLS0tLS0jIyMjIyMjIyMjIyMjIyMjIy5fLi0uLURFUExPWS1DT05UQUlORVIuLS5fLiMjIyMjIyMjIyMjIyMjIyMjLS0tLS0tLS0tLS0tLS0tLS4uLi4uLi4uLiIKYXdzIGVjci1wdWJsaWMgZ2V0LWxvZ2luLXBhc3N3b3JkIC0tcmVnaW9uIHVzLWVhc3QtMSB8IHN1ZG8gZG9ja2VyIGxvZ2luIC0tdXNlcm5hbWUgQVdTIC0tcGFzc3dvcmQtc3RkaW4gcHVibGljLmVjci5hd3MvaDV2OGs1eTgKc3VkbyBkb2NrZXIgcnVuIC1kIC1wIDgwMDA6ODAwMCAtLW5hbWUgYXBwIHB1YmxpYy5lY3IuYXdzL2g1djhrNXk4L2FwcDowLjE="
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + arn = (known after apply)
        }
    }

  # module.was.aws_security_group.was will be created
  + resource "aws_security_group" "was" {
      + arn                    = (known after apply)
      + description            = "joo-was-sg"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow app"
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8000
            },
        ]
      + name                   = "joo-was-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"  = "joo-was-sg"
          + "owner" = "joo"
        }
      + tags_all               = {
          + "Name"  = "joo-was-sg"
          + "owner" = "joo"
        }
      + vpc_id                 = (known after apply)
    }

  # module.web.aws_autoscaling_group.this will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 2
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 4
      + metrics_granularity              = "1Minute"
      + min_size                         = 2
      + name                             = "joo-web-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "5m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id   = (known after apply)
          + name = (known after apply)
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "joo-web"
        }
      + tag {
          + key                 = "owner"
          + propagate_at_launch = true
          + value               = "joo"
        }
    }

  # module.web.aws_launch_template.web will be created
  + resource "aws_launch_template" "web" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "joo-web-launch-template"
      + id                     = (known after apply)
      + image_id               = "ami-037f5c5c1aab1ae51"
      + instance_type          = "t3.micro"
      + key_name               = "juiceb"
      + latest_version         = (known after apply)
      + name                   = "joo-web-launch-template"
      + name_prefix            = (known after apply)
      + tags                   = {
          + "Name"  = "joo-web-launch-template"
          + "owner" = "joo"
        }
      + tags_all               = {
          + "Name"  = "joo-web-launch-template"
          + "owner" = "joo"
        }
      + user_data              = "IyEvYmluL2Jhc2gKCmVjaG8gIi4uLi4uLi4uLi0tLS0tLS0tLS0tLS0tLS0jIyMjIyMjIyMjIyMjIyMjIy5fLi0uLUlOU1RBTEwtRG9ja2VyLi0uXy4jIyMjIyMjIyMjIyMjIyMjIy0tLS0tLS0tLS0tLS0tLS0uLi4uLi4uLi4iCnN1ZG8gYXB0LWdldCB1cGRhdGUKc3VkbyBhcHQtZ2V0IGluc3RhbGwgY2EtY2VydGlmaWNhdGVzIGN1cmwgZ251cGcgLXkKc3VkbyBpbnN0YWxsIC1tIDA3NTUgLWQgL2V0Yy9hcHQva2V5cmluZ3MKY3VybCAtZnNTTCBodHRwczovL2Rvd25sb2FkLmRvY2tlci5jb20vbGludXgvdWJ1bnR1L2dwZyB8IHN1ZG8gZ3BnIC0tZGVhcm1vciAtbyAvZXRjL2FwdC9rZXlyaW5ncy9kb2NrZXIuZ3BnCnN1ZG8gY2htb2QgYStyIC9ldGMvYXB0L2tleXJpbmdzL2RvY2tlci5ncGcKZWNobyBcCiAgImRlYiBbYXJjaD0iJChkcGtnIC0tcHJpbnQtYXJjaGl0ZWN0dXJlKSIgc2lnbmVkLWJ5PS9ldGMvYXB0L2tleXJpbmdzL2RvY2tlci5ncGddIGh0dHBzOi8vZG93bmxvYWQuZG9ja2VyLmNvbS9saW51eC91YnVudHUgXAogICIkKC4gL2V0Yy9vcy1yZWxlYXNlICYmIGVjaG8gIiRWRVJTSU9OX0NPREVOQU1FIikiIHN0YWJsZSIgfCBcCiAgc3VkbyB0ZWUgL2V0Yy9hcHQvc291cmNlcy5saXN0LmQvZG9ja2VyLmxpc3QgPiAvZGV2L251bGwKc3VkbyBhcHQtZ2V0IHVwZGF0ZQpzdWRvIGFwdC1nZXQgaW5zdGFsbCBkb2NrZXItY2UgZG9ja2VyLWNlLWNsaSBjb250YWluZXJkLmlvIGRvY2tlci1idWlsZHgtcGx1Z2luIGRvY2tlci1jb21wb3NlLXBsdWdpbiAteQoKZWNobyAiLi4uLi4uLi4uLS0tLS0tLS0tLS0tLS0tLSMjIyMjIyMjIyMjIyMjIyMjLl8uLS4tSU5TVEFMTC1BV1MtQ0xJLi0uXy4jIyMjIyMjIyMjIyMjIyMjIy0tLS0tLS0tLS0tLS0tLS0uLi4uLi4uLi4iCnN1ZG8gYXB0IGluc3RhbGwgdW56aXAgLXkKY3VybCAiaHR0cHM6Ly9hd3NjbGkuYW1hem9uYXdzLmNvbS9hd3NjbGktZXhlLWxpbnV4LXg4Nl82NC56aXAiIC1vICJhd3NjbGl2Mi56aXAiCnN1ZG8gdW56aXAgYXdzY2xpdjIuemlwCnN1ZG8gLi9hd3MvaW5zdGFsbCAtaSAvdXNyL2xvY2FsL2F3cy1jbGkgLWIgL3Vzci9sb2NhbC9iaW4KCmVjaG8gIi4uLi4uLi4uLi0tLS0tLS0tLS0tLS0tLS0jIyMjIyMjIyMjIyMjIyMjIy5fLi0uLURFUExPWS1DT05UQUlORVIuLS5fLiMjIyMjIyMjIyMjIyMjIyMjLS0tLS0tLS0tLS0tLS0tLS4uLi4uLi4uLiIKYXdzIGVjci1wdWJsaWMgZ2V0LWxvZ2luLXBhc3N3b3JkIC0tcmVnaW9uIHVzLWVhc3QtMSB8IHN1ZG8gZG9ja2VyIGxvZ2luIC0tdXNlcm5hbWUgQVdTIC0tcGFzc3dvcmQtc3RkaW4gcHVibGljLmVjci5hd3MvaDV2OGs1eTgKc3VkbyBkb2NrZXIgcnVuIC1kIC1wIDgwOjgwIC0tbmFtZSBuZ2lueCBwdWJsaWMuZWNyLmF3cy9oNXY4azV5OC9uZ2lueDowLjE="
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + arn = (known after apply)
        }
    }

  # module.web.aws_security_group.web will be created
  + resource "aws_security_group" "web" {
      + arn                    = (known after apply)
      + description            = "joo-web-sg"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow http"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow https"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "joo-web-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"  = "joo-web-sg"
          + "owner" = "joo"
        }
      + tags_all               = {
          + "Name"  = "joo-web-sg"
          + "owner" = "joo"
        }
      + vpc_id                 = (known after apply)
    }

Plan: 55 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + lb_sg_id            = (known after apply)
  + vpc_id              = (known after apply)
  + vpc_zone_identifier = [
      + (known after apply),
      + (known after apply),
    ]
  + was_sg_id           = (known after apply)
  + web_sg_id           = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

 ```

 </details>

 **위의 내용으로 테라폼 배포를 요청합니다!**

 *Pusher: @juiceb7597, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform AWS Workflow`*